"""б) Дан двійковий файл f, компоненти якого є дійсними числами. Знайти суму,
добуток, суму квадратів і квадрат добутку компонентів файлу f, а також останню
компоненту файлу. Результати записати у файл g.
Мельник Д.В. 122А
"""


import random

number_list = [random.uniform(0, 50) for i in range(5)]  # Генеруємо компоненти для файлу f

with open('f.bin', 'wb') as f_file:  # Відкриваємо файл як бінарний у режимі редагування
    for number in number_list:  # Додаємо компоненти
        item = str(number) + '\n'  # Перетворюємо їх у стрічки та ставимо їх у окремі рядки
        byte_string = item.encode()  # Кодуємо компоненти у байти
        f_file.write(byte_string)  # Передаємо послідовність байт у файл

f_file = open('f.bin', 'rb')  # Відкриваємо файл f у режимі зчитування даних
g_file = open('g.txt', 'w')  # Відкриваємо файл g у режимі редагування даних

for string in f_file:  # Проходимо по послідовністях байт у файлі f
    line = string.decode()  # Перетворюємо послідовність байт назад у компоненти
    g_file.write(line)  # Передаємо компоненти у нормальному вигляді в файл g

g_file = open('g.txt', 'r')  # Відкриваємо файл g у режимі зчитування
print(g_file.read())  # Виводимо на екран наші компоненти

sum = 0  # Змінні для обчислень
product = 1
sum_sqrt = 0
line = 0  # Остання змінна після циклу запишеться у цю глобальну змінну

g_file = open('g.txt', 'r')  # Знову відкриваємо файл g у режимі зчитування
for line in g_file:  # Проходимо по стрічкам текстового файлу
    line = float(line)  # Перетворюємо наш компонент в зі стрічки в число з крапкою
    sum += line  # Сума компонентів файлу
    product *= line  # Добуток компонентів файлу
    sum_sqrt += line**2  # Сума квадратів компонентів файлу
print(f'Сума компонентів файлу f: {sum}')
print(f'Добуток компонентів файлу f:{product}')
print(f'Сума квадратів компонентів файлу f: {sum_sqrt}')
print(f'Квадрат добутку компонентів файлу f: {product**2}')  # Квадрат добутку компонентів розрахуємо в f рядку, щоб не використовувати зайву змінну
print(f'Остання компонента: {line}')
g_file.close()  # Закриваємо файли g та f
f_file.close()
